In [50]:
#Write your code here
import pandas as pd 
df = pd.read_csv("D:\\Onedrive\\01 All Files\\03 Study\\DataScience\\pandas\\Pandas Practice assignment\\Pandas Practice assignment\\Data\\Purchase_Data.csv")

In [92]:

df

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0
...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

In [52]:
# Use the dtypes attribute to view how each column is stored
#Write your code here
df.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

In [94]:
#Slice the first two columns using .loc and store the result in a variable called result_1.
result_1 = df.loc[0:5382 ,['invoice_number','invoice_time']]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

In [ ]:
Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [108]:
    #Slice the first two rows using .loc and store the result in a variable called result_2.
result_2 = df.loc[0:1,['invoice_number','invoice_time','store_id','product_id','category_id','num_item','price']]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [129]:
result_3 = df.iloc[0:4,[1,2,3,4,5]]
result_3

    invoice_time store_id  product_id  category_id  num_item
0  7/15/15 10:45     G816     7000300       210101       1.0
1  7/15/15 12:16     G816     7070884        70203       1.0
2  7/15/15 12:16     G816     7070884        70203       1.0
3  7/15/15 12:16     G816     7070891        70401       1.0

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [135]:
result_4  = df.loc[[0,4,6],['invoice_time','price']]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [167]:
num_row = df.shape[0]
num_row

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [183]:
last_raw = df.iloc[num_row - 1:num_row]
last_raw

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [187]:
avg_price = df['price'].mean()
avg_price

3.1920522110741363

In [191]:
max_price = df['price'].max()
max_price

6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [201]:
avg_price, avg_num_items = df[["price", "num_item"]].mean()
print("Average Price:", avg_price)
print("Average Number of Items Purchased:", avg_num_items)

Average Price: 3.1920522110741363
Average Number of Items Purchased: 1.2983091787439613

create a column called "total", which is the product of the price and num_item columns.

In [211]:
df['total'] = df['price'] * df['num_item']
df['total']

0       2.0
1       2.0
2       2.0
3       6.0
4       6.0
       ...
5377    3.0
5378    6.0
5379    5.0
5380    4.0
5381    2.0
Name: total, Length: 5382, dtype: float64

What is the avgerage price of the three most expensive purchases?

In [236]:
price_sorted = df.sort_values(by ='price',ascending=False)['price'].head(3).mean()
price_sorted

6.003333333333333

In [246]:
#anther way
df.nlargest(3,'price')['price'].mean()

6.003333333333333

How many different products are there?

In [289]:
dnumber_of_prodect = df['product_id'].nunique()
dnumber_of_prodect

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [291]:
df.describe()

,invoice_number,product_id,category_id,num_item,price,total
count,5.382000e+03,5.382000e+03,5382.000000,5382.000000,5382.000000,5382.000000
mean,2.020000e+11,8.740911e+06,115465.616499,1.298309,3.192052,3.931808
std,0.000000e+00,5.048294e+06,65448.435316,2.168725,1.652007,5.820520
min,2.020000e+11,7.000034e+06,70101.000000,0.500000,0.000000,0.000000
25%,2.020000e+11,7.070884e+06,70201.000000,1.000000,2.000000,2.000000
50%,2.020000e+11,7.071096e+06,70401.000000,1.000000,2.500000,3.000000
75%,2.020000e+11,7.090592e+06,210101.000000,1.000000,5.000000,5.000000
max,2.020000e+11,3.000077e+07,210301.000000,116.000000,6.010000,348.000000

In [293]:
# the mean 
df['total'].mean()

3.931807878112784

In [297]:
# the median
df['total'].median()

3.0

Use the drop() method to delete the column total from the dataframe df_data.

In [307]:
df.drop('total',axis = 1)

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0
...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [317]:
df['invoice_time'] = pd.to_datetime(df['invoice_time'] ,format = "%m/%d/%y %H:%M")
df['invoice_time']

0      2015-07-15 10:45:00
1      2015-07-15 12:16:00
2      2015-07-15 12:16:00
3      2015-07-15 12:16:00
4      2015-07-15 12:16:00
               ...
5377   2015-09-05 23:07:00
5378   2015-09-05 23:23:00
5379   2015-09-05 23:24:00
5380   2015-09-05 23:32:00
5381   2015-09-05 23:38:00
Name: invoice_time, Length: 5382, dtype: datetime64[ns]

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [337]:
df['DOW'] = df['invoice_time'].dt.day_name()
df['DOW']

0       Wednesday
1       Wednesday
2       Wednesday
3       Wednesday
4       Wednesday
          ...
5377     Saturday
5378     Saturday
5379     Saturday
5380     Saturday
5381     Saturday
Name: DOW, Length: 5382, dtype: object

In [341]:
df['Month'] = df['invoice_time'].dt.month_name()
df['Month']

0            July
1            July
2            July
3            July
4            July
          ...
5377    September
5378    September
5379    September
5380    September
5381    September
Name: Month, Length: 5382, dtype: object

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [382]:
num_purchases_wed = df["DOW"].value_counts()['Wednesday']

In [380]:
num_purchases_wed

959

In [384]:
df_t = pd.read_csv("D:\\Onedrive\\01 All Files\\03 Study\\DataScience\\pandas\\Pandas Practice assignment\\Pandas Practice assignment\\Data\\Titanic.csv")

In [388]:
df_t.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [407]:
df_t.rename(columns={'Name':'Passenger_Name','Ticket':'Ticket_Num'})

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Change the index of the df_titanic to the column PasengerID.

In [417]:
df_t.set_index("Passengerid", inplace=True)

KeyError: "None of ['Passengerid'] are in the columns"

Select the name of passenger 896

In [ ]:
df_titanic.loc[896, "Name"]